[
    {
        "id": 1,
        "name": "Mission Innovator / คณะสหวิทยาการ เทคโนโลยีและนวัตรกรรม SPU : Thelsinki",
        "startdate": "2021-02-06T17:00:00.000Z",
        "enddate": "2021-04-27T17:00:00.000Z",
        "ishighlight": false
    },
    {
        "id": 2,
        "name": "Game for developing critical thinking skills and distinguishing facts (Mystmentary)",
        "description": "เป็นเกมแนวสืบสวนสอบสวนที่ผู้เล่นจะได้รับบทเป็นชายคนหนึ่งที่ตกเป็นผู้ต้องสงสัยในคดีฆาตกรรมซึ่งเขาไม่ได้ทำ ดังนั้นผู้เล่นจึงต้องพยายามหาหลักฐานต่างๆ มาใช้ในการพิสูจน์ความบริสุทธิ์ของตัวเองให้ถูกต้องภายในเวลาที่กำหนด เพื่อที่จะได้รอดพ้นจากคดี",
        "tools": "พัฒนาโดยใช้โปรแกรม Unity, ภาษา C# รวมไปถึงโปรแกรม Blender และโปรแกรมอื่นๆ ร่วมด้วย",
        "purpose": "ส่งเข้าประกวด การแข่งขันพัฒนาโปรแกรมคอมพิวเตอร์แห่งประเทศไทย ครั้งที่ 24 (NSC2022)",
        "benefit": "ได้เรียนรู้เกี่ยวกับการพัฒนาเกม ตั้งแต่การคิดและออกแบบเกม, การออกแบบด่าน, การทำโมเดล 3D, การเขียนโปรแกรม รวมไปถึงได้ฝึกการทำงานเป็นทีม, การเขียนรายงานและนำเสนอผลงาน",
        "startdate": "2021-09-29T17:00:00.000Z",
        "enddate": "2022-02-12T17:00:00.000Z",
        "ishighlight": true
    },
    {
        "id": 3,
        "name": "Kidbright Onstage / NECTEC : Arcanic Show",
        "startdate": "2021-12-12T17:00:00.000Z",
        "enddate": "2022-02-12T17:00:00.000Z",
        "ishighlight": true
    },
    {
        "id": 4,
        "name": "SPSM : Truck Manager",
        "description": "ผลงานแบ่งเป็น 2 ส่วน ได้แก่ \n - Static Page สำหรับแนะนำข้อมูลเบื้องต้นของบริษัท โดยสามารถเข้าดูได้ที่ www.sisgas.com \n - ระบบสำหรับการบริหารการขนส่งก๊าซอุตสาหกรรม ที่ใช้ในการเก็บ, จัดเรียงข้อมูล, วางแผนการจัดส่งและรายงานผลการจัดส่งก๊าซ ซึ่งพัฒนาแบบ Full Stack",
        "tools": "- Static Page พัฒนาด้วยใช้ภาษา HTML และ CSS \n - ระบบสำหรับการบริหารการขนส่งก๊าซอุตสาหกรรม พัฒนาด้วย Angular.js, Node.js, Nest.js, MySQL โดยใช้ Github, Postman, Figma และ Trello ร่วมด้วย",
        "purpose": "เป็นโครงงานในเกณฑ์จบระดับชั้นมัธยมศึกษาตอนปลาย",
        "benefit": "ได้เรียนรู้เกี่ยวกับการพัฒนาเว็ปไซต์, การพัฒนาเว็ปแอพลิเคชั่นแบบ Full Stack นอกจากนี้ยังได้เรียนรู้เกี่ยวกับการทำงานในสถานการณ์จริง, ได้ผึกใช้งาน Github และได้ฝึกการทำงานเป็นทีม ด้วยการทำงานแบบ Agile Methodology และการทำงานแบบ Scrum",
        "startdate": "2022-03-26T17:00:00.000Z",
        "ishighlight": true
    },
    {
        "id": 5,
        "name": "To Be IT’66 / KMITL : Smart Plant Pot",
        "startdate": "2022-06-17T17:00:00.000Z",
        "enddate": "2022-06-25T17:00:00.000Z",
        "ishighlight": false
    },
    {
        "id": 6,
        "name": "Web portfolio",
        "description": "เป็นเว็ปไซต์ส่วนตัวที่รวบรวมผลงาน กิจกรรมและโปรเจ็กต์ที่เคยทำของฉัน เพื่อสำหรับใส่ข้อมูลเพิ่มเติมจากในเล่ม portfolio รวมถึงเพื่อฝึกทักษะการพัฒนาเว็ปไซต์อีกด้วย",
        "tools": "พัฒนาโดยใช้ react ภาษา html, css, js โดยใช้เครื่องมืออื่นๆ เช่น photoshop, figma ร่วมด้วย",
        "startdate": "2022-07-05T17:00:00.000Z",
        "ishighlight": true
    },
    {
        "id": 7,
        "name": "Punpun’s : Horwang Sportyard Line Bot",
        "description": "เป็น Line Chatbot สำหรับให้นักเรียนใช้ในการจองสนามกีฬาของโรงเรียน โดยเชื่อมกับ Google sheet เพื่อเก็บข้อมูลการจองสนามกีฬาประเภทต่างๆ ",
        "tools": "พัฒนาโดยใช้ Botnoi สำหรับการพัฒนา Chatbot และ App script ในการเขียน api เชื่อมต่อกับ Google sheet",
        "startdate": "2022-08-20T17:00:00.000Z",
        "enddate": "2022-09-01T17:00:00.000Z",
        "ishighlight": true
    },
    {
        "id": 8,
        "name": "JWC 12 : Octopus Fortune Webpage",
        "ishighlight": false
    },
    {
        "id": 9,
        "name": "itcamp 18",
        "startdate": "2022-07-13T17:00:00.000Z",
        "enddate": "2022-07-16T17:00:00.000Z",
        "ishighlight": false
    }
]