[
  {
    "id": 1,
    "name": "Amazing Apple Game",
    "description": "เป็นเกมสำหรับฝึกคำนวณเลขอย่างง่ายๆ (การบวกและการคูณ) ซึ่งมีกติกาคือผู้เล่นจะต้องขยับตะกร้าไปเก็บแอปเปิ้ลที่หล่นลงมา ถ้าเก็บได้ก็จะได้คะแนนเพิ่ม แต่ถ้าไม่ได้ก็จะเสียคะแนน โดยที่แอปเปิ้ลที่เก็บได้ก็จะมีโอกาสที่จะมีคำถามให้ผู้เล่นได้คำนวณเลข ถ้าตอบได้ก็จะได้คะแนนพิเศษ และผิดก็เสียคะแนนเพิ่มเช่นกัน เกมจะจบก็ต่อเมื่อผู้เล่นมีคะแนนครบ 200 (ชนะ) หรือคะแนนเหลือน้อยกว่า 0 (แพ้)",
    "tools": "พัฒนาโดยใช้โปรแกรม Scratch",
    "purpose": "เป็นโครงงานที่ทำในวิชาคอมพิวเตอร์ ในระดับมัธยมศึกษาตอนต้น",
    "benefit": "ได้ฝึกกระบวนการคิดในการสร้างระบบเกมและเขียนโปรแกรม, ฝึกการใช้ความคิดสร้างสรรค์และการประยุกต์ใช้งานโปรแกรม",
    "moreInfo": "https://scratch.mit.edu/projects/318985696",
    "coverImage": "https://i.postimg.cc/Xv4HM33S/Project-Cover-Amazing-Apple.jpg",
    "images": "AmazingAppleGame",
    "startDate": "01/06/2019",
    "endDate": "12/07/2019",
    "isHighlight": true,
    "isHide": false
  },
  {
    "id": 2,
    "name": "Thelsinki",
    "description": "เป็นแอพลิเคชันที่ทำหน้าที่เป็นพื้นที่พักผ่อนและส่งต่อกำลังใจเพื่อให้ทุกๆ วันของผู้ใช้งานเป็นวันที่ดีมากขึ้น ซึ่งจะประกอบด้วยฟังก์ชันหลักทั้งหมด 3 อย่างคือ \\n 1. พื้นที่แลกกำลังใจ ส่งต่อข้อความให้กำลังใจให้กับผู้อื่นและรับข้อความให้กำลังใจของคนอื่นที่ส่งมาหา ช่วย Made my day ให้กับวันนั้น \\n 2. พื้นที่พักผ่อน พูดคุยเล่นกับแชทบอท รวมถึงสามารถระบายเรื่องไม่สบายใจต่างๆ ที่ไม่อยากบอกคนอื่นก็ได้ \\n 3. พื้นที่สำหรับจดบันทึกความทรงจำต่างๆ อารมณ์ในแต่ละวัน โดยจะมีคำถาม ถามผู้ใช้ ทำให้สามารถจดบันทึกเรื่องราวในวันนั้นๆ ได้ โดยที่ไม่ต้องเขียนเรียงความยาวๆ เอง \\n และมีฟังก์ชันย่อยๆ อื่นเช่น สรุปผลภาพรวมอารมณ์ของเราในแต่ละเดือน",
    "tools": "เป็นเพียงแค่แนวคิด ยังไม่ได้ลงมือทำจริง",
    "purpose": "ส่งเข้าประกวดรายการ Mission Innovator (จัดโดย คณะสหวิทยาการ เทคโนโลยีและนวัตรกรรม SPU)",
    "furtherDev": "ลงมือทำจริง",
    "benefit": "ได้ฝึกในการคิดวิเคราะห์และการใช้ความคิดสร้างสรรค์, การทำงานเป็นทีมและการนำเสนอไอเดีย",
    "moreInfo": "https://1drv.ms/u/s!Au-TIaKIDl0Iq7g_tiK27D4SpucUYQ?e=f3Krit",
    "coverImage": "https://i.postimg.cc/Dy4YLB5D/Project-Cover-Thelsinki.jpg",
    "startDate": "07/02/2021",
    "endDate": "28/04/2021",
    "isHighlight": false,
    "isHide": false
  },
  {
    "id": 3,
    "name": "Game for developing critical thinking skills and distinguishing facts (Mystmentary)",
    "description": "เป็นเกมแนวสืบสวนสอบสวนที่ผู้เล่นจะได้รับบทเป็นชายคนหนึ่งที่ตกเป็นผู้ต้องสงสัยในคดีฆาตกรรมซึ่งเขาไม่ได้ทำ ดังนั้นผู้เล่นจึงต้องพยายามหาหลักฐานต่างๆ มาใช้ในการพิสูจน์ความบริสุทธิ์ของตัวเองให้ถูกต้องภายในเวลาที่กำหนด เพื่อที่จะได้รอดพ้นจากคดี",
    "tools": "พัฒนาโดยใช้โปรแกรม Unity, ภาษา C# รวมไปถึงโปรแกรม Blender และโปรแกรมอื่นๆ ร่วมด้วย",
    "purpose": "ส่งเข้าประกวด การแข่งขันพัฒนาโปรแกรมคอมพิวเตอร์แห่งประเทศไทย ครั้งที่ 24 (NSC2022)",
    "furtherDev": "\\n 1. เพิ่มเติมเนื้อเรื่องจนจบ \\n 2. เพิ่มเติมหลากหลายและสมเหตุสมผลให้กับหลักฐาน \\n 3. พัฒนาระบบช่องเก็บของ ให้ผู้เล่นสามารถเลือกเก็บ / ทิ้งหลักฐานได้",
    "benefit": "ได้เรียนรู้เกี่ยวกับการพัฒนาเกม ตั้งแต่การคิดและออกแบบเกม, การออกแบบด่าน, การทำโมเดล 3D, การเขียนโปรแกรม รวมไปถึงได้ฝึกการทำงานเป็นทีม, การเขียนรายงานและนำเสนอผลงาน",
    "moreInfo": "https://drive.google.com/drive/mobile/folders/1jNCy3NwRs747P103_cXFpF-ugDk-aiPD?usp=sharing",
    "coverImage": "https://i.postimg.cc/xjxWKkQk/Project-Cover-Mystmentary.jpg",
    "startDate": "30/09/2021",
    "endDate": "13/02/2022",
    "isHighlight": true,
    "isHide": false
  },
  {
    "id": 4,
    "name": "Arcanic Show",
    "description": "เป็นโชว์ที่แสดงร่วมกับหุ่นยนต์ ที่มีเรื่องราวเกี่ยวกับผู้วิเศษที่ต้องการรวบรวมพลังและใช้จักรกลเพื่อครองโลก โดยในการแสดงใช้หุ่นยนต์ที่ควบคุมด้วยบอร์ด Kidbright จำนวน 5 ตัว โดยสื่อสารกันด้วยบลูธูท และมี 1 ในนั้นที่ใช้ Kidbright AI ในการทำ Image recognition ตรวจจับการ์ดที่ใช้เรียกพลังธาตุต่างๆ ให้หุ่นยนต์ตัวอื่นๆ ตอบสนองแตกต่างกันไปตามธาตุนั้นๆ",
    "tools": "หุ่นยนต์จะแบ่งเป็น 3 ประเภทคือ \\n - หุ่นมาสเตอร์ (เป็นหุ่นที่เป็นสื่อเวทย์ใช้ร่ายเวทย์ส่งต่อไปยังตัวอื่นๆ) : ใช้ Kidbright AI เพื่อทำ Image Recognition ตรวจจับว่าการ์ดพลังเวทย์ที่ถูกนำมาโชว์คือธาตุอะไร แล้วส่งสัญญาณบลูธูทไปให้หุ่นบริวารและฉาก \\n - หุ่นบริวาร (เป็นหุ่นที่ได้รับคำสั่งจากสื่อเวทย์) : ใช้เซนเซอร์ เพื่อเดินตามเส้น จนได้รับสัญญาณจากหุ่นมาสเตอร์ จึงจะเปลี่ยนสีหรือลักษณะการเดินตามธาตุนั้นๆ \\n - ฉาก (พื้นที่บริเวณโดยรอบที่ได้รับผลกระทบจากพลังเวทย์) : รอจนหุ่นบริวารเดินผ่านหน้าเซนเซอร์จะเปิดไฟตามสีธาตุขณะนั้นที่ส่งมาผ่านบลูธูท",
    "purpose": "ส่งเข้าประกวด การแข่งขัน Kidbright Onstage 2022",
    "furtherDev": "\\n 1. เพิ่มจำนวนตัวหุ่นบริวาร และปรับเป็น 1 ตัวต่อ 1 ธาตุ \\n 2. ปรับเปลี่ยนตัวพัดลมของตัวเอไอ เพราะตอนนี้ยังทำงานได้ไม่ดีเท่าที่ควร \\n 3. ปรับเปลี่ยนรูปร่างหน้าตาของตัวหุ่นและฉากให้มีความสวยงามและเพื่อให้ช่วยส่งเสริมการแสดงมากขึ้น",
    "benefit": "ได้ฝึกฝนเกี่ยวกับการพัฒนาระบบ IoT, การทำการสื่อสารด้วยบลูธูทและการทำ Image Recognition ด้วย AI รวมถึงได้ความรู้อื่นๆ จากการอบรม โดยเฉพาะเกี่ยวกับการออกแบบและการแสดง นอกจากนี้ยังได้ฝึกการทำงานเป็นทีมและการทำงานภายใต้ความกดดัน",
    "moreInfo": "https://1drv.ms/v/s!Au-TIaKIDl0Iq7hAu2ZxgTSuNjyYcg?e=B2jKq2",
    "coverImage": "https://i.postimg.cc/j5jM5XLM/Project-Cover-Arcanic-Show.jpg",
    "startDate": "13/12/2021",
    "endDate": "13/02/2022",
    "isHighlight": true,
    "isHide": false
  },
  {
    "id": 5,
    "name": "Truck Manager",
    "description": "ผลงานแบ่งเป็น 2 ส่วน ได้แก่ \\n - Static Page สำหรับแนะนำข้อมูลเบื้องต้นของบริษัท โดยสามารถเข้าดูได้ที่ www.sisgas.com \\n - ระบบสำหรับการบริหารการขนส่งก๊าซอุตสาหกรรม ที่ใช้ในการเก็บ, จัดเรียงข้อมูล, วางแผนการจัดส่งและรายงานผลการจัดส่งก๊าซ ซึ่งพัฒนาแบบ Full Stack",
    "tools": "การพัฒนาใช้เครื่องมือได้แก่ \\n - Static Page พัฒนาด้วยใช้ภาษา HTML และ CSS \\n - ระบบสำหรับการบริหารการขนส่งก๊าซอุตสาหกรรม พัฒนาด้วย Angular.js, Node.js, Nest.js, MySQL โดยใช้ Github, Postman, Figma และ Trello ร่วมด้วย",
    "purpose": "เป็นโครงงานในเกณฑ์จบระดับชั้นมัธยมศึกษาตอนปลาย",
    "furtherDev": "\\n 1. นำไปทดลองใช้จริงและนำความคิดเห็นของผู้ใช้มาปรับปรุง \\n 2. ปรับปรุงฟังก์ชันที่มีอยู่ให้ดียิ่งขึ้น \\n 3. ทำให้หน้าตาสวยงามและใช้งานง่ายมากยิ่งขึ้น",
    "benefit": "ได้เรียนรู้เกี่ยวกับการพัฒนาเว็ปไซต์, การพัฒนาเว็ปแอพลิเคชั่นแบบ Full Stack นอกจากนี้ยังได้เรียนรู้เกี่ยวกับการทำงานในสถานการณ์จริง, ได้ผึกใช้งาน Github และได้ฝึกการทำงานเป็นทีม ด้วยการทำงานแบบ Agile Methodology และการทำงานแบบ Scrum",
    "moreInfo": "https://www.canva.com/design/DAFKBqsrgLg/8nrXNYVDz83St0WUb6uTwA/view?utm_content=DAFKBqsrgLg&utm_campaign=designshare&utm_medium=link&utm_source=publishsharelink",
    "coverImage": "https://i.postimg.cc/xd5sn7Tk/Project-Cover-Truck-Manager.jpg",
    "startDate": "27/03/2022",
    "isHighlight": true,
    "isHide": false
  },
  {
    "id": 6,
    "name": "Smart Plant Pot",
    "description": "เป็นอุปกรณ์ IoT ที่พัฒนามาเพื่อช่วยในการปลูกต้นไม้ ให้ผู้ใช้งานสามารถปลูกต้นไม้ได้ง่าย สะดวกสบายและถูกวิธียิ่งขึ้น โดยประกอบไปด้วย \\n - อุปกรณ์ IoT : ใช้บอร์ด Arduino ที่เชื่อมต่อกับเซนเซอร์และอุปกรณ์อื่นๆ เช่นปั๊มน้ำ และส่งข้อมูลผ่าน Wifi บันทึกลง Firebase ซึ่งจะส่งแจ้งเตือนมาให้ผู้ใช้เลือกว่าจะรดน้ำด้วยตัวเองหรือให้รดน้ำอัตโนมัติในกรณีที่ไม่สะดวกรดน้ำด้วยตัวเอง เมื่อความชื้นเหลือค่อนข้างน้อย และเมื่อความชื้นน้อยจนต้องรดน้ำก็จะส่งแจ้งเตือนไปให้ผู้ใช้หรือรดน้ำให้อัตโนมัติตามที่ได้เลือกไว้ก่อนหน้า \\n - Chatbot : ใช้ในการให้คำแนะนำในการปลูกต้นไม้ คุยเล่น แจ้งเตือนเกี่ยวกับปริมาณน้ำ (เมื่อได้เวลาสมควรไปรดน้ำ) และใช้ในการควบคุมการรดน้ำอัตโนมัติ",
    "tools": "พัฒนาด้วยบอร์ด Arduino ESP8266 โดยมีอุปกรณ์ต่างๆ เช่นเซนเซอร์, ปั๊มน้ำ เชื่อมต่อกับ Firebase และใช้ Botnoi Platform ในการพัฒนา Chatbot",
    "purpose": "เป็นโครงงานที่ทำระหว่างเข้าร่วมค่าย To Be IT'66 (จัดโดย คณะเทคโนโลยีสารสนเทศ KMITL)",
    "furtherDev": "\\n 1. ตัดสินใจในการเปลี่ยนบอร์ดเพื่อให้สามารถต่อเซนเซอร์ได้ครบตามที่ต้องการ \\n 2. เปลี่ยนไปใช้ฐานข้อมูลอื่นๆ แทน Firebase \\n 3. พัฒนาแชทบอทให้สามารถโต้ตอบได้ดียิ่งขึ้น และเพิ่มเติมฟีเจอร์อื่นๆ ให้สามารถใช้งานได้ตามวัตถุประสงค์",
    "benefit": "ได้เรียนรู้และฝึกทักษะการเขียนโปรแกรมบนอุปกรณ์ IoT เชื่อมต่อ Wifi และเชื่อมกับ Firebase, ได้เรียนรู้เกี่ยวกับการพัฒนา Chatbot, ได้ฝึกการคิดเพื่อแก้ปัญหา, การทำงานเป็นทีมและการทำงานให้เสร็จภายในเวลาที่กำหนด",
    "moreInfo": "https://1drv.ms/b/s!Au-TIaKIDl0Iot19FChGOlfhJIVjbw?e=BBKza7",
    "coverImage": "https://i.postimg.cc/3NRVshXJ/Project-Cover-Smart-Plant-Pot.jpg",
    "startDate": "18/06/2022",
    "endDate": "26/06/2022",
    "isHighlight": false,
    "isHide": false
  },
  {
    "id": 7,
    "name": "Octopus Fortune",
    "description": "เป็นการทำเว็บไซต์จากตัวอย่างโจทย์ที่มีมาให้",
    "tools": "พัฒนาด้วยภาษา HTML, CSS",
    "purpose": "สำหรับส่งในการคัดเลือกค่าย JWC ครั้งที่ 12",
    "moreInfo": "https://piinxluna.github.io/JWC12_octopus-fortune/",
    "coverImage": "https://i.postimg.cc/NfKZbgGd/Project-Cover-Octopus-Fortune.jpg",
    "startDate": "20/06/2022",
    "endDate": "23/06/2022",
    "isHighlight": false,
    "isHide": false
  },
  {
    "id": 8,
    "name": "Network Project",
    "description": "ผลงานแบ่งออกแบบ 2 ส่วนคือ \\n - โปรแกรม Packet Tracer ที่คอมพิวเตอร์ 8 เครื่อง แบ่งเป็น 4 vlan ติดต่อกันผ่าน Switch L2 & L3 และ Router ตามที่โจทย์กำหนด (ใช้ Static Route) \\n - การ config Rack เพื่อให้อุปกรณ์ที่มีสามารถ ping หากันได้ โดยมี PC 4 เครื่อง, Switch L2 & L3 และ Router (ใช้ Static Route)",
    "tools": "การพัฒนาได้ใช้โปรแกรม Cisco Packet Tracer",
    "purpose": "เป็นโครงงานที่ทำระหว่างเข้าร่วมค่าย IT Camp ครั้งที่ 18 (จัดโดย คณะเทคโนโลยีสารสนเทศ KMITL)",
    "benefit": "ได้เรียนรู้เกี่ยวกับความรู้พื้นฐานของ network และการ config ค่าอุปกรณ์ network, ได้ฝึกทักษะการทำงานเป็นทีมและการนำเสนอผลงาน",
    "moreInfo": "https://www.canva.com/design/DAFGjcDfmRM/vddIZbFE16FqiTJuIeUeCQ/watch?utm_content=DAFGjcDfmRM&utm_campaign=designshare&utm_medium=link&utm_source=publishsharelink",
    "coverImage": "https://i.postimg.cc/gk1QTfnm/Project-Cover-Network-Project.jpg",
    "startDate": "14/07/2022",
    "endDate": "17/07/2022",
    "isHighlight": false,
    "isHide": false
  },
  {
    "id": 9,
    "name": "Sportyard Line Bot",
    "description": "เป็น Line Chatbot สำหรับให้นักเรียนใช้ในการจองสนามกีฬาของโรงเรียน โดยเชื่อมกับ Google sheet เพื่อเก็บข้อมูลการจองสนามกีฬาประเภทต่างๆ ",
    "tools": "พัฒนาโดยใช้ Botnoi Platform สำหรับการพัฒนา Chatbot และ App script ในการเขียน api เชื่อมต่อกับ Google sheet",
    "furtherDev": "เพิ่มระบบยกเลิกการจอง, ระบบตรวจสอบการจองที่ผู้ใช้งานได้จองไว้, ระบบแจ้งเตือนเมื่อถึงเวลาที่จอง และเพิ่มเติมระบบที่ให้ผุชู้ใช้สามารถหาเพื่อนเล่นกีฬาได้",
    "benefit": "ได้เรียนรู้เกี่ยวกับการพัฒนาแชทบอท, การใช้งาน API และการเขียน API เชื่อมต่อกับ Google sheet เพื่อตรวจสอบและแก้ไขข้อมูลในตาราง",
    "coverImage": "https://i.postimg.cc/ZqSgTp8Q/Project-Cover-Sportyard-Line-Bot.jpg",
    "startDate": "21/08/2022",
    "endDate": "02/09/2022",
    "isHighlight": true,
    "isHide": false
  },
  {
    "id": 10,
    "name": "Web portfolio",
    "description": "เป็นเว็ปไซต์ส่วนตัวที่รวบรวมผลงาน กิจกรรมและโปรเจ็กต์ที่เคยทำของฉัน เพื่อสำหรับใส่ข้อมูลเพิ่มเติมจากในเล่ม portfolio รวมถึงเพื่อฝึกทักษะการพัฒนาเว็ปไซต์อีกด้วย",
    "tools": "พัฒนาโดยใช้ react, bootstrap, ภาษา html, css, js โดยใช้เครื่องมืออื่นๆ เช่น photoshop, figma ร่วมด้วย",
    "furtherDev": "\\n 1. ปรับแต่งให้มีความสวยงามมากยิ่งขึ้น \\n 2. เขียน API เพื่อเรียกข้อมูลจาก Google sheet โดยตรง ไม่ต้องสร้างไฟล์ .json ด้วยตัวเอง \\n 3. ในหน้า Activity & Project ทำฟังก์ชันให้สามารถเสิร์ชได้และสามารถใส่แท็กให้แต่ละอันได้",
    "benefit": "ได้เรียนรู้เกี่ยวกับการพัฒนาเว็บไซต์ด้วย React & การ Hosting เว็บไซต์ด้วย github, ได้เรียนรู้การใช้งาน Bootstrap และได้ฝึกทักษะในการสืบค้นข้อมูลสำหรับทำงานด้วยตัวเองอีกด้วย",
    "moreInfo": "https://piinxluna.github.io/profile/",
    "coverImage": "https://i.postimg.cc/0jMZGyGm/Project-Cover-Web-Portfolio.jpg",
    "startDate": "02/10/2022",
    "isHighlight": true,
    "isHide": false
  },
  {
    "id": 11,
    "name": "Survive the night",
    "description": "เป็นเว็ปไซต์เกี่ยวกับเกม Blockman Go (ธีมของการแข่งขัน) ประกอบไปด้วยข้อมูลเกี่ยวกับเกมและมินิเกมชื่อ Survive the night \\n ในเกม Survive the night มีเนื้อเรื่องเกี่ยวกับโลกที่ถูกซอมบี้บุก เราที่แอบอยู่ในบ้านก็กำลังโดนซอมบี้พยายามจะบุกบ้านเข้ามา ต้องเอาตัวรอดผ่านแต่ละคืนด้วยการทายคำศัพท์ให้ถูกต้อง เอาตัวรอดให้ได้นานพอที่ซอมบี้จะหายไป \\n โดยมีลักษณะวิธีการเล่นเกมเหมือนกับ Hangman แต่แบ่งเป็นหลายๆ ด่าน (ใน 1 ด่านมี 1 คำ และถือว่าเป็น 1 คืนในเนื้อเรื่อง)",
    "tools": "พัฒนาด้วยภาษา HTML, CSS, JavaScript",
    "purpose": "ส่งเข้าร่วมประกวดทำเว็ปไซต์รายการ Gamer to coder (จัดโดยบริษัท Garena)",
    "furtherDev": "\\n 1. หาวิธีในการทำ encrypt ข้อมูล เพื่อป้องกันการโกงจากการมาดูคำตอบใน code \\n 2. เพิ่มคำศัพท์ (ให้ใน 1 เลเวลมีคำมากกว่าจำนวนวัน) และเพิ่มฟังก์ชันเกี่ยวกับการแปลคำศัพท์ ช่วยให้ผู้เล่นได้เรียนรู้คำศัพท์นั้นๆ \\n 3. เพิ่ม event เหตุการณ์ (เนื้อเรื่อง) / ความสามารถให้กับตัวละครหลัก สร้างความหลากหลายและความตื่นเต้นให้กับการเล่น",
    "benefit": "ได้ฝึกฝนทักษะการเขียนโปรแกรมภาษา HTML, CSS, JavaScript รวมถึงได้เรียนรู้การทำงานภายใต้เวลาที่จำกัด, ฝึกทักษะการทำงานร่วมกับผู้อื่นและการสืบค้นข้อมูล",
    "moreInfo": "https://ltrlf.github.io/Gamer-to-Coder/",
    "coverImage": "https://i.postimg.cc/D08pCghS/Project-Cover-Survive-The-Night.jpg",
    "startDate": "26/10/2022",
    "endDate": "31/10/2022",
    "isHighlight": false,
    "isHide": false
  },
  {
    "id": 12,
    "name": "IT DE Puzzle Game",
    "description": "เป็นเว็ปไซต์ที่ใช้ในการทำกิจกรรมหน้าเสาธงที่จัดโดยวิชาเอก IT DE \\n ในกิจกรรมผู้เล่นจะต้องทายคำปริศนาให้ถูกต้อง โดยตัวอักษรแต่ละตัวในคำปริศนาจะมีตัวเลขกำกับ หากตัวเลขเป็นตัวเลขเดียวกัน จะหมายความว่าตัวอักษรในตำแหน่งนั้นๆ เป็นตัวอักษรเดียวกัน \\n ภายในหน้าเว็ปคำที่อยู่ในกรอบสีฟ้าด้านบนสุดคือคำปริศนา ส่วนคำด้านล่างจะเป็นคำใบ้ ให้ผู้เล่นคิดคำที่ตรงกับคำใบ้ เพื่อหาตัวอักษรในแต่ละตำแหน่ง ก่อนจะนำไปใช้หาคำปริศนาในตอนสุดท้าย",
    "tools": "พัฒนาด้วยภาษา HTML, CSS, JavaScript และใช้ bootstrap 5 และ figma ร่วมด้วย",
    "purpose": "ใช้ในการจัดกิจกรรมหน้าเสาธงของวิชาเอก IT, DE",
    "benefit": "ได้ฝึกทักษะการเขียนโปรแกรมในภาษา HTML CSS JS,การใช้ bootstrap,การใช้โปรแกรม figma นอกจากนี้ยังได้ฝึกการทำงานเป็นทีม, ความคิดสร้างสรรค์และการทำงานและปรับตัวตามข้อติชมที่ได้รับ",
    "moreInfo": "https://piinxluna.github.io/IT_PuzzleGame/",
    "coverImage": "https://i.postimg.cc/kMfH5Bg8/ITDEPuzzle-Game.png",
    "startDate": "05/11/2022",
    "endDate": "19/12/2022",
    "isHighlight": true,
    "isHide": false
  },
  {
    "id": 13,
    "name": "ทำสรุปเนื้อหาวิชาคณิตศาสตร์",
    "description": "ทำสรุปเนื้อหาวิชาคณิตศาสตร์ระดับมัธยมศึกษาตอนปลาย เพื่อนำไปให้คณะกรรมการนักเรียนจัดทำเว็ปไซต์สำหรับเผยแพร่สรุปเนื้อหาและคลิปวีดีโออธิบายโจทย์ให้กับเพื่อนคนอื่นๆ",
    "purpose": "เข้าร่วมโครงการของคณะกรรมการนักเรียนปี 2022",
    "benefit": "ได้ฝึกฝนการเรียบเรียง ทำความเข้าใจและวิเคราะห์เนื้อหาที่เรียน ได้ทบทวนความรู้และสูตรต่างๆ รวมถึงได้มีโอกาสแบ่งปันสรุปให้กับคนอื่นๆ ใช้ในการเรียนรู้อีกด้วย",
    "moreInfo": "https://psmtunjai.vercel.app/lecture",
    "startDate": "25/11/2022",
    "endDate": "29/11/2022",
    "isHighlight": false,
    "isHide": false
  }
]
